In [1]:
import pandas as pd

In [38]:
# data frame
# 2D labelled array

info = {
    "name" : ["Pritam", "Sritam", "Pritesh", "Sakhi"],
    "CGPA" : [9.5, 8.5, 9.3, 9.2]
    
}
# Convert this dict into data frame by DataFrame()
df = pd.DataFrame(info)
print(df)

# It shows us like a table, keys = header of the table
# In out put the numbering shows (0,1,2,3), these numbers are the lables, automatically created.

# Print all columns
print(df.index)

# print the index
print(df.columns)

# data frame is also be a list of list
animal_prop = pd.DataFrame([["Tiger", 4], ["Cat", 4], ["duck", 2]], columns = ["Animal", "Legs"])
print(animal_prop)

      name  CGPA
0   Pritam   9.5
1   Sritam   8.5
2  Pritesh   9.3
3    Sakhi   9.2
RangeIndex(start=0, stop=4, step=1)
Index(['name', 'CGPA'], dtype='object')
  Animal  Legs
0  Tiger     4
1    Cat     4
2   duck     2

In [44]:
# We can use list of list and data frame in numpy array also
import numpy as np
np_arr = np.array([[1,2,3],[4,5,6]])
df = pd.DataFrame(np_arr, columns=["A", "B", "C"])
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [9]:
# Series
# 1D labelled array

nums = [1,2,3,4,5,6]
# Convert this list into series by Series()
s = pd.Series(nums)
print(s)

# We can access indivisual value also by index based and labeled based
# Index based access
print(s[0])
print(s[2])

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64
1
3

In [17]:
# We can also define our custome labels
age_val = [25, 24,16, 20]

s = pd.Series(age_val, index = ["Pritam", "Sritam", "Pritesh", "Sakhi"])
print(s)

# Print all labeled value
print(s.index)

# Access value by babel, label based access
print(s["Pritam"]) # 25
print(s["Sakhi"]) #20

Pritam     25
Sritam     24
Pritesh    16
Sakhi      20
dtype: int64
Index(['Pritam', 'Sritam', 'Pritesh', 'Sakhi'], dtype='object')
25
20

In [31]:
# Series proporties
# 1 : Series are homogenous (Same type of data)
nums = [1,2,"ABC"] # It is not recomended
s = pd.Series(nums)
print(s)
# data type is object

# 2 : Vectorizzed operations.
nums1 = [1,2,3,4,5,6]
nums2 = [4,5,3,6,7,4]

s1 = pd.Series(nums1)
s2 = pd.Series(nums2)

print(s1 + s2)

# 3 : handle missing value with NaN
nums1 = [1,2,3,4,5,6]
nums2 = [4,5,3,6]

s1 = pd.Series(nums1)
s2 = pd.Series(nums2)

print(s1 + s2)

# 4 : Mutable values, immutable size
nums = [1,2,3,4,5,6]
s1 = pd.Series(nums)
s1[0] = 100
s1[5] = 600
print(s1)

# drop the first element
nums = [111,222,333]
s1 = pd.Series(nums)

changed_s1= s1.drop(0)
print(s1)
print(changed_s1)

# All these proporties are also work in data frame also

0      1
1      2
2    ABC
dtype: object
0     5
1     7
2     6
3    10
4    12
5    10
dtype: int64
0     5.0
1     7.0
2     6.0
3    10.0
4     NaN
5     NaN
dtype: float64
0    100
1      2
2      3
3      4
4      5
5    600
dtype: int64
0    111
1    222
2    333
dtype: int64
1    222
2    333
dtype: int64

In [48]:
# json data
df = pd.read_json("pd_employee_data.json")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [45]:
# CSV file
df = pd.read_csv("pd_employee_data.csv")
print(df, type(df))

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0 <class 'pandas.core.frame.DataFrame'>

In [47]:
# Similarly we can read excen and sql data also using read_excel(), read_sql()

In [49]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [51]:
# DataFrame methods
# - very help full for doing EDA

# print(df.head()) or for tabular structure format use like below
df.head()
# Print initial 5 rows

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000

In [52]:
df.tail()

# print last 5 values

   ID    Name  Age Department  Salary
5   6   Frank   29    Finance   50000
6   7   Grace   41         HR   82000
7   8  Hannah   26  Marketing   47000
8   9     Ian   35         IT   75000
9  10   Julia   30    Finance   60000

In [53]:
# if we want to print last 2 rows only
df.tail(2)

Similarly for head also

   ID   Name  Age Department  Salary
8   9    Ian   35         IT   75000
9  10  Julia   30    Finance   60000

In [58]:
df.sample()

# print a random row

   ID   Name  Age Department  Salary
3   4  David   45  Marketing   91000
6   7  Grace   41         HR   82000

In [60]:
# If we want any 2 random values
df.sample(2)

   ID   Name  Age Department  Salary
1   2    Bob   32         IT   72000
5   6  Frank   29    Finance   50000

In [61]:
df.info()

# Give a summary of our data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [64]:
df.shape
# Give (row,column)

(10, 5)

In [65]:
df.describe()

# Give count, min value, standard deviation(std), min, %, max val of numerical column

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [69]:
df.columns

# Show all column name

Index(['ID', 'Name', 'Age', 'Department', 'Salary'], dtype='object')

In [70]:
df.nunique()

# Show unique rows on all columns

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64